app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Abdoulaye"], ["email", "njigouhrazak@iut-dhaka.edu"], ["password", "151515"], ["created_at", "2020-06-11 12:32:55.830687"], ["updated_at", "2020-06-11 12:32:55.830687"]]
---
  def create
    @user = User.new(user_params)
    # @user = User.new(name: params[:name], email: params[:email], password: params[:password])
    if @user.save